const majorList = [
  // ■ 인문대학
  ['국어국문학과', '인문대학'],
  ['영어영문학과', '인문대학'],
  ['유럽문화학부', '인문대학'],
  ['아시아문화학부', '인문대학'],
  ['철학과', '인문대학'],
  ['역사학과', '인문대학'],

  // ■ 사회과학대학
  ['정치국제학과', '사회과학대학'],
  ['사회학과', '사회과학대학'],
  ['심리학과', '사회과학대학'],
  ['사회복지학부', '사회과학대학'],
  ['미디어커뮤니케이션학부', '사회과학대학'],
  ['광고홍보학과', '사회과학대학'],
  ['도시계획·부동산학과', '사회과학대학'],

  // ■ 경영경제대학
  ['경제학부', '경영경제대학'],
  ['경영학부', '경영경제대학'],
  ['응용통계학과', '경영경제대학'],
  ['지식경영학부', '경영경제대학'],
  ['국제물류학과', '경영경제대학'],

  // ■ 사범대학
  ['교육학과', '사범대학'],
  ['유아교육과', '사범대학'],
  ['사회교육과', '사범대학'],
  ['영어교육과', '사범대학'],
  ['체육교육과', '사범대학'],

  // ■ 자연과학대학
  ['수학과', '자연과학대학'],
  ['물리학과', '자연과학대학'],
  ['화학과', '자연과학대학'],
  ['생명과학과', '자연과학대학'],

  // ■ 공과대학
  ['기계공학부', '공과대학'],
  ['전기전자공학부', '공과대학'],
  ['건축학부', '공과대학'],
  ['화학신소재공학부', '공과대학'],
  ['사회기반시스템공학부', '공과대학'],
  ['공업교육학부', '공과대학'],

  // ■ 창의ICT공과대학
  ['컴퓨터공학부', '창의ICT공과대학'],
  ['인공지능학과', '창의ICT공과대학'],
  ['소프트웨어학부', '창의ICT공과대학'],
  ['정보보호학과', '창의ICT공과대학'],

  // ■ 예술대학
  ['문예창작학과', '예술대학'],
  ['영화전공', '예술대학'],
  ['연극전공', '예술대학'],
  ['무용전공', '예술대학'],
  ['사진전공', '예술대학'],
  ['공연영상창작학부', '예술대학'],

  // ■ 체육대학
  ['스포츠과학부', '체육대학'],

  // ■ 의과대학 & 보건의과학대학
  ['의학부', '의과대학 & 보건의과학대학'],
  ['간호학과', '의과대학 & 보건의과학대학'],
  ['의생명과학과', '의과대학 & 보건의과학대학'],
  ['스포츠의학과', '의과대학 & 보건의과학대학'],
  ['약학부', '의과대학 & 보건의과학대학'],

  // ■ 적십자간호대학
  ['적십자간호학과', '적십자간호대학'],

  // ■ 예술공학대학
  ['예술공학부', '예술공학대학'],
  ['실감미디어콘텐츠전공', '예술공학대학'],
  ['게임·메타버스전공', '예술공학대학'],

  // --------------------------------
  // ■ 다빈치캠퍼스 (안성)
  // --------------------------------

  // ○ 생명공학대학
  ['생명자원공학부 (다빈치)', '생명공학대학 (다빈치)'],
  ['식품공학부 (다빈치)', '생명공학대학 (다빈치)'],
  ['시스템생명공학과 (다빈치)', '생명공학대학 (다빈치)'],
  ['동물생명공학과 (다빈치)', '생명공학대학 (다빈치)'],
  ['식물생명공학과 (다빈치)', '생명공학대학 (다빈치)'],

  // ○ 공과대학(안성)
  ['첨단소재공학과 (다빈치)', '공과대학 (다빈치)'],
  ['에너지시스템공학과 (다빈치)', '공과대학 (다빈치)'],
  ['환경공학과 (다빈치)', '공과대학 (다빈치)'],

  // ○ 예술대학(안성)
  ['실내환경디자인전공 (다빈치)', '예술대학 (다빈치)'],
  ['산업디자인전공 (다빈치)', '예술대학 (다빈치)'],
  ['시각디자인전공 (다빈치)', '예술대학 (다빈치)'],
  ['패션전공 (다빈치)', '예술대학 (다빈치)'],
  ['공예전공 (다빈치)', '예술대학 (다빈치)'],
  ['사진전공 (다빈치)', '예술대학 (다빈치)'],
  ['무용전공 (다빈치)', '예술대학 (다빈치)'],
  ['음악학과 (다빈치)', '예술대학 (다빈치)'],
  ['성악전공 (다빈치)', '예술대학 (다빈치)'],
  ['피아노전공 (다빈치)', '예술대학 (다빈치)'],
  ['관현악전공 (다빈치)', '예술대학 (다빈치)'],
  ['작곡전공 (다빈치)', '예술대학 (다빈치)'],

  // ○ 체육대학(안성)
  ['스포츠과학부 (다빈치)', '체육대학 (다빈치)'],
];

export default majorList;
